// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую 
// декаду месяца попадает это число (в первую, вторую или третью).

// В переменной month лежит какое-то число из интервала от 1 до 12. Определите в какую 
// пору года попадает этот месяц (зима, лето, весна, осень).

// Дана строка, состоящая из символов, например, 'abcde'. Проверьте, что первым символом 
// этой строки является буква 'a'. Если это так - выведите 'да', в противном случае 
// выведите 'нет'.

// Дана строка с цифрами, например, '12345'. Проверьте, что первым символом этой строки 
// является цифра 1, 2 или 3. Если это так - выведите 'да', в противном случае выведите 
// 'нет'.

// Дана строка из 3-х цифр. Найдите сумму этих цифр. То есть сложите как числа первый 
// символ строки, второй и третий.

// Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых 
// трех цифр. Если это так - выведите 'да', в противном случае выведите 'нет'.
