// Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b. Показать решение.
let a = 12;
let b = 3;

//  Даны переменные a и b. Проверьте, что a делится без остатка на b. Если это так - 
// выведите 'Делится' и результат деления, иначе выведите 'Делится с остатком' и остаток
//  от деления. Показать решение.


// Для решения задач данного блока вам понадобятся следующие методы: Math.pow, Math.sqrt.
//  Возведите 2 в 10 степень. Результат запишите в переменную st.
// console.log(Math.pow(2, 10))
//  Найдите квадратный корень из 245.

//  Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. Найдите квадратный корень из суммы 
// кубов его элементов. Для решения воспользуйтесь циклом for.
let arr = [4, 2, 5, 19, 13, 0, 10];

// Для решения задач данного блока вам понадобятся следующие функции: Math.round, 
// Math.ceil, Math.floor, toFixed, toPrecision.
//  Найдите квадратный корень из 379. Результат округлите до целых, до десятых, до 
// сотых.

//  Найдите квадратный корень из 587. Округлите результат в большую и меньшую стороны, 
// запишите результаты округления в объект с ключами 'floor' и 'ceil'.

// Нахождение максимального и минимального числа
// Для решения задач данного блока вам понадобятся следующие методы: Math.max, Math.min.
//  Даны числа 4, -2, 5, 19, -130, 0, 10. Найдите минимальное и максимальное число.

// Для решения задач данного блока вам понадобятся следующие методы: Math.random.
//  Выведите на экран случайное целое число от 1 до 100.

//  Заполните массив 10-ю случайными целыми числами. (Подсказка: нужно воспользоваться циклами for или while). Показать решение.
let arr1 = [];

// Для решения задач данного блока вам понадобятся следующие методы: Math.abs.
//  Даны переменные a и b. Найдите найдите модуль разности a и b. Проверьте работу 
// скрипта самостоятельно для различных a и b.

//  Даны переменные a и b. Отнимите от a переменную b и результат присвойте переменной 
// c. Сделайте так, чтобы в любом случае в переменную c записалось положительное значение. 
// Проверьте работу скрипта при a и b, равных соответственно 3 и 5, 6 и 1.

//  Дан массив arr. Найдите среднее арифметическое его элементов. Проверьте задачу на 
//массиве с элементами 12, 15, 20, 25, 59, 79.

//  Напишите скрипт, который будет находить факториал числа. Факториал (обозначается !)
// - это произведение (умножение) всех целых чисел, меньше данного, и его самого. Например, 4! = 1*2*3*4.



